Autodesk.Revit.DB.CurveOverlapPoint.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.CurveOverlapPoint.SecondParameter
The point's unnormalized parameter on the second curve.
Since:
2026

Autodesk.Revit.DB.CurveOverlapPoint.FirstParameter
The point's unnormalized parameter on the first curve.
Since:
2026

Autodesk.Revit.DB.CurveOverlapPoint.Point
The 3D coordinate of the point.
Since:
2026

Autodesk.Revit.DB.CurveOverlapPoint.Type
The type of overlap at the point.
Since:
2026

Autodesk.Revit.DB.CurveOverlapPoint
A point of overlap of two curves and its type of overlap.
Since:
2026